poli-vsb-cz/SDK_2_3_1_MK22DX128xxx5/boards/twrk21d50m/usb_examples/usb_device_composite_hid_audio_unified_lite/bm/fsl_sgtl5000.c
uint32_t SGTL_GetVolume(sgtl_handle_t *handle, sgtl_module_t module)
{
    uint16_t vol = 0;
    switch (module)
    {
        case kSGTL_ModuleADC:
            SGTL_ReadReg(handle, CHIP_ANA_ADC_CTRL, &vol);
            vol = (vol & (uint16_t)SGTL5000_ADC_VOL_LEFT_GET_MASK) >> SGTL5000_ADC_VOL_LEFT_SHIFT;
            break;
        case kSGTL_ModuleDAC:
            SGTL_ReadReg(handle, CHIP_DAC_VOL, &vol);
            vol = (vol & (uint16_t)SGTL5000_DAC_VOL_LEFT_GET_MASK) >> SGTL5000_DAC_VOL_LEFT_SHIFT;
            break;
        case kSGTL_ModuleHP:
            SGTL_ReadReg(handle, CHIP_ANA_HP_CTRL, &vol);
            vol = (vol & (uint16_t)SGTL5000_HP_VOL_LEFT_GET_MASK) >> SGTL5000_HP_VOL_LEFT_SHIFT;
            break;
        case kSGTL_ModuleLineOut:
            SGTL_ReadReg(handle, CHIP_LINE_OUT_VOL, &vol);
            vol = (vol & (uint16_t)SGTL5000_LINE_OUT_VOL_LEFT_GET_MASK) >> SGTL5000_LINE_OUT_VOL_LEFT_SHIFT;
            break;
        default:
            vol = 0;
            break;
    }
    return vol;
}

status_t SGTL_SetMute(sgtl_handle_t *handle, sgtl_module_t module, bool mute)
{
    status_t ret = kStatus_Success;
    switch (module)
    {
        case kSGTL_ModuleADC:
            SGTL_ModifyReg(handle, CHIP_ANA_CTRL, SGTL5000_MUTE_ADC_CLR_MASK, mute);
            break;
        case kSGTL_ModuleDAC:
            if (mute)
            {
                SGTL_ModifyReg(handle, CHIP_ADCDAC_CTRL,
                               SGTL5000_DAC_MUTE_LEFT_CLR_MASK & SGTL5000_DAC_MUTE_RIGHT_CLR_MASK, 0x000C);
            }
            else
            {
                SGTL_ModifyReg(handle, CHIP_ADCDAC_CTRL,
                               SGTL5000_DAC_MUTE_LEFT_CLR_MASK & SGTL5000_DAC_MUTE_RIGHT_CLR_MASK, 0x0000);
            }
            break;
        case kSGTL_ModuleHP:
            SGTL_ModifyReg(handle, CHIP_ANA_CTRL, SGTL5000_MUTE_HP_CLR_MASK,
                           ((uint16_t)mute << SGTL5000_MUTE_HP_SHIFT));
            break;
        case kSGTL_ModuleLineOut:
            SGTL_ModifyReg(handle, CHIP_ANA_CTRL, SGTL5000_MUTE_LO_CLR_MASK,
                           ((uint16_t)mute << SGTL5000_MUTE_LO_SHIFT));
            break;
        default:
            ret = kStatus_InvalidArgument;
            break;
    }
    return ret;
}

status_t SGTL_ConfigDataFormat(sgtl_handle_t *handle, uint32_t mclk, uint32_t sample_rate, uint8_t bits)
{
    uint16_t val = 0;
    uint16_t regVal = 0;
    status_t retval = kStatus_Success;
    uint16_t mul_clk = 0U;
    uint32_t sysFs = 0U;

    /* Over sample rate can only up to 512, the least to 8k */
    if ((mclk / (MIN(sample_rate * 6U, 96000U)) > 512U) || (mclk / sample_rate < 256U))
    {
        return kStatus_InvalidArgument;
    }

    /* Configure the sample rate */
    switch (sample_rate)
    {
        case 8000:
            if (mclk > 32000U * 512U)
            {
                val = 0x0038;
                sysFs = 48000;
            }
            else
            {
                val = 0x0020;
                sysFs = 32000;
            }
            break;
        case 11025:
            val = 0x0024;
            sysFs = 44100;
            break;
        case 12000:
            val = 0x0028;
            sysFs = 48000;
            break;
        case 16000:
            if (mclk > 32000U * 512U)
            {
                val = 0x003C;
                sysFs = 96000;
            }
            else
            {
                val = 0x0010;
                sysFs = 32000;
            }
            break;
        case 22050:
            val = 0x0014;
            sysFs = 44100;
            break;
        case 24000:
            if (mclk > 48000U * 512U)
            {
                val = 0x002C;
                sysFs = 96000;
            }
            else
            {
                val = 0x0018;
                sysFs = 48000;
            }
            break;
        case 32000:
            val = 0x0000;
            sysFs = 32000;
            break;
        case 44100:
            val = 0x0004;
            sysFs = 44100;
            break;
        case 48000:
            if (mclk > 48000U * 512U)
            {
                val = 0x001C;
                sysFs = 96000;
            }
            else
            {
                val = 0x0008;
                sysFs = 48000;
            }
            break;
        case 96000:
            val = 0x000C;
            sysFs = 96000;
            break;
        default:
            retval = kStatus_InvalidArgument;
            break;
    }

    SGTL_ReadReg(handle, CHIP_I2S_CTRL, &regVal);

    /* While as slave, Fs is input */
    if ((regVal & SGTL5000_I2S_MS_GET_MASK) == 0U)
    {
        sysFs = sample_rate;
    }
    mul_clk = mclk / sysFs;
    /* Configure the mul_clk. Sgtl-5000 only support 256, 384 and 512 oversample rate */
    if ((mul_clk / 128U - 2U) > 2U)
    {
        return kStatus_InvalidArgument;
    }
    else
    {
        val |= (mul_clk / 128U - 2U);
    }
    SGTL_WriteReg(handle, CHIP_CLK_CTRL, val);

    /* Data bits configure,sgtl supports 16bit, 20bit 24bit, 32bit */
    SGTL_ModifyReg(handle, CHIP_I2S_CTRL, 0xFEFF, SGTL5000_I2S_SCLKFREQ_64FS);
    switch (bits)
    {
        case 16:
            SGTL_ModifyReg(handle, CHIP_I2S_CTRL, SGTL5000_I2S_DLEN_CLR_MASK, SGTL5000_I2S_DLEN_16);
            break;
        case 20:
            SGTL_ModifyReg(handle, CHIP_I2S_CTRL, SGTL5000_I2S_DLEN_CLR_MASK, SGTL5000_I2S_DLEN_20);
            break;
        case 24:
            SGTL_ModifyReg(handle, CHIP_I2S_CTRL, SGTL5000_I2S_DLEN_CLR_MASK, SGTL5000_I2S_DLEN_24);
            break;
        case 32:
            SGTL_ModifyReg(handle, CHIP_I2S_CTRL, SGTL5000_I2S_DLEN_CLR_MASK, SGTL5000_I2S_DLEN_32);
            break;
        default:
            retval = kStatus_InvalidArgument;
            break;
    }

    return retval;
}

status_t SGTL_WriteReg(sgtl_handle_t *handle, uint16_t reg, uint16_t val)
{
    uint8_t buff[2];
    status_t retval = 0;

    /* Data copied to buff*/
    buff[0] = (val & 0xFF00U) >> 8U;
    buff[1] = val & 0xFF;

#if defined(FSL_FEATURE_SOC_LPI2C_COUNT) && (FSL_FEATURE_SOC_LPI2C_COUNT)
    uint8_t data[4] = {0};
    data[0] = (reg & 0xFF00U) >> 8U;
    data[1] = reg & 0xFFU;
    data[2] = buff[0];
    data[3] = buff[1];
    retval = LPI2C_MasterStart(handle->base, SGTL5000_I2C_ADDR, kLPI2C_Write);
    retval = LPI2C_MasterSend(handle->base, data, 4);
    retval = LPI2C_MasterStop(handle->base);
#else
    /* Set I2C xfer structure */
    handle->xfer.direction = kI2C_Write;
    handle->xfer.subaddress = (uint32_t)reg;
    handle->xfer.subaddressSize = 2U;
    handle->xfer.data = buff;
    handle->xfer.dataSize = 2U;

    retval = I2C_MasterTransferBlocking(handle->base, &handle->xfer);
#endif

    return retval;
}

status_t SGTL_ReadReg(sgtl_handle_t *handle, uint16_t reg, uint16_t *val)
{
    uint8_t data[2];
    status_t retval = 0;

#if defined(FSL_FEATURE_SOC_LPI2C_COUNT) && (FSL_FEATURE_SOC_LPI2C_COUNT)
    uint8_t buff[2] = {0};
    buff[0] = (reg & 0xFF00U) >> 8U;
    buff[1] = reg & 0xFFU;
    retval = LPI2C_MasterStart(handle->base, SGTL5000_I2C_ADDR, kLPI2C_Write);
    retval = LPI2C_MasterSend(handle->base, buff, 2);
    retval = LPI2C_MasterStart(handle->base, SGTL5000_I2C_ADDR, kLPI2C_Read);
    retval = LPI2C_MasterReceive(handle->base, data, 2);
    retval = LPI2C_MasterStop(handle->base);
#else
    /* Configure I2C xfer */
    handle->xfer.direction = kI2C_Read;
    handle->xfer.subaddress = (uint32_t)reg;
    handle->xfer.subaddressSize = 2U;
    handle->xfer.data = data;
    handle->xfer.dataSize = 2U;

    retval = I2C_MasterTransferBlocking(handle->base, &handle->xfer);
#endif

    /* Handle the return data */
    *val = (uint16_t)(((uint32_t)data[0] << 8U) | (uint32_t)data[1]);

    return retval;
}

status_t SGTL_ModifyReg(sgtl_handle_t *handle, uint16_t reg, uint16_t clr_mask, uint16_t val)
{
    status_t retval = 0;
    uint16_t reg_val;

    /* Read the register value out */
    retval = SGTL_ReadReg(handle, reg, &reg_val);
    if (retval != kStatus_Success)
    {
        return kStatus_Fail;
    }

    /* Modify the value */
    reg_val &= clr_mask;
    reg_val |= val;

    /* Write the data to register */
    retval = SGTL_WriteReg(handle, reg, reg_val);
    if (retval != kStatus_Success)
    {
        return kStatus_Fail;
    }

    return kStatus_Success;
}
